// 🎅 ДАННЫЕ ТАЙНОГО САНТЫ
// Сгенерировано автоматически 4/2/2026, 4:00:49 PM
// НЕ РЕДАКТИРУЙТЕ ВРУЧНУЮ!

// 🎲 РЕЗУЛЬТАТЫ ЖЕРЕБЬЁВКИ (Map<string, string>)
// Формат: ID Санты → ID Получателя
/*
  670286 → 187910 (Дивчина → Дивчина)
  985082 → 727635 (Дивчина → МУЖИК)
  880018 → 668224 (МУЖИК → МУЖИК)
  668224 → 985082 (МУЖИК → Дивчина)
  187910 → 880018 (Дивчина → МУЖИК)
  734562 → 332574 (МУЖИК → МУЖИК)
  332574 → 734562 (МУЖИК → МУЖИК)
  727635 → 670286 (МУЖИК → Дивчина)

*/

export type DeliveryDataKeys = "gender" | "wishes" | "ozon_address" | "wb_address";
export type DeliveryDataValue = string;
export type DeliveryData = Record<DeliveryDataKeys, DeliveryDataValue>;

export const DELIVERY_DATA = new Map<string, DeliveryData>([
  [ "670286", {
    gender: "Дивчина",
    wishes: "Не стеклянное :<",
    ozon_address: "Самара, ул Ново-Садовая, 181",
    wb_address: "Самара, ул Ново-Садовая 179"
  }],
  [ "985082", {
    gender: "МУЖИК",
    wishes: "https://ozon.ru/t/T8BvOTX",
    ozon_address: "Новосибирск, улица Кошурникова, 24/1",
    wb_address: "Новосибирск, Улица Бориса Богаткова 213"
  }],
  [ "880018", {
    gender: "МУЖИК",
    wishes: "Аниме/ПУБГ",
    ozon_address: "Чебоксары, Новогородская 28",
    wb_address: "Соседний дом, не помню адрес, тоже Чебоксары Новогородская, но тот что ближе к 28"
  }],
  [ "668224", {
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Тула, улица Октябрьская 217 корпус 1",
    wb_address: "Тула, улица Октябрьская 217 корпус 2"
  }],
  [ "187910", {
    gender: "МУЖИК",
    wishes: "люблю кемпинг",
    ozon_address: "Самара. Георгия Димитрова, 62",
    wb_address: "Самара. Стара-Загора 160"
  }],
  [ "734562", {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Нижегородская область, Дзержинск, улица Гайдара, 34",
    wb_address: "Дзержинск, улица Гайдара 35"
  }],
  [ "332574", {
    gender: "МУЖИК",
    wishes: "ОГРОМНЫЙ ХУЙ",
    ozon_address: "Москва, Магнитогорская ул., 7",
    wb_address: "(МИ)НЕТ"
  }],
  [ "727635", {
    gender: "Дивчина",
    wishes: "Пожалуйста без сладкого ( конфетки/шоколад/мед)🙏",
    ozon_address: "Лобня, Лобненский б-р, 9",
    wb_address: "Лобня, Лобненский б-р, 9"
  }]
]);