// 🎅 ДАННЫЕ ТАЙНОГО САНТЫ
// Сгенерировано автоматически. НЕ РЕДАКТИРУЙТЕ ВРУЧНУЮ!

// 🎲 РЕЗУЛЬТАТЫ ЖЕРЕБЬЁВКИ (Map<string, string>)
// Формат: ID Санты → ID Получателя
/*
  534550 → 219576 (Дивчина → МУЖИК)
  558748 → 764364 (МУЖИК → Дивчина)
  443698 → 802229 (МУЖИК → Дивчина)
  153116 → 942635 (Дивчина → МУЖИК)
  726011 → 153116 (МУЖИК → Дивчина)
  957273 → 373036 (МУЖИК → МУЖИК)
  942635 → 534550 (МУЖИК → Дивчина)
  373036 → 726011 (МУЖИК → МУЖИК)
  762566 → 389815 (МУЖИК → Дивчина)
  144740 → 558748 (МУЖИК → МУЖИК)
  389815 → 443698 (Дивчина → МУЖИК)
  764364 → 757074 (Дивчина → Дивчина)
  802229 → 144740 (Дивчина → МУЖИК)
  757074 → 762566 (Дивчина → МУЖИК)
  219576 → 957273 (МУЖИК → МУЖИК)
*/

export type DeliveryDataKeys = "gender" | "wishes" | "ozon_address" | "wb_address";
export type DeliveryDataValue = string;

export type DeliveryData = Record<DeliveryDataKeys, DeliveryDataValue>

export const DELIVERY_DATA = new Map<string, DeliveryData>([
  [ "219576", {
    gender: "Дивчина",
    wishes: "Что-нибудь полезное 🥦",
    ozon_address: "Москва, улица Набережная 137 корпус 1",
    wb_address: "Москва, улица Набережная 137 корпус 1"
  }],
  [ "764364", {
    gender: "МУЖИК",
    wishes: "Как есть",
    ozon_address: "Челябинск, улица Молодежная 91",
    wb_address: "Москва, улица Советская 26 корпус 2"
  }],
  [ "802229", {
    gender: "МУЖИК",
    wishes: "Обожаю сладости, особенно шоколад и печенье! Чем слаще, тем лучше 🍪😋",
    ozon_address: "Ростов-на-Дону, улица Советская 84 корпус 5",
    wb_address: "Ростов-на-Дону, улица Советская 84 корпус 5"
  }],
  [ "942635", {
    gender: "Дивчина",
    wishes: "На ваше усмотрение",
    ozon_address: "Новосибирск, улица Набережная 25 корпус 3",
    wb_address: "Новосибирск, улица Набережная 25 корпус 3"
  }],
  [ "153116", {
    gender: "МУЖИК",
    wishes: "Как есть",
    ozon_address: "Нижний Новгород, улица Садовая 98",
    wb_address: "Москва, улица Садовая 101"
  }],
  [ "373036", {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Казань, улица Пушкина 191",
    wb_address: "Москва, улица Мира 33"
  }],
  [ "534550", {
    gender: "МУЖИК",
    wishes: "Средства для ухода 🧴",
    ozon_address: "Санкт-Петербург, улица Гагарина 72 корпус 1",
    wb_address: "Санкт-Петербург, улица Гагарина 72 корпус 1"
  }],
  [ "726011", {
    gender: "МУЖИК",
    wishes: "Сюрприз! Главное - внимание и забота 🥰💖",
    ozon_address: "Омск, улица Пушкина 85",
    wb_address: "Омск, улица Пушкина 85"
  }],
  [ "389815", {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Казань, улица Пушкина 160",
    wb_address: "Казань, улица Пушкина 160"
  }],
  [ "558748", {
    gender: "МУЖИК",
    wishes: "Чай или кофе ☕",
    ozon_address: "Казань, улица Пушкина 76 корпус 1",
    wb_address: "Казань, улица Пушкина 76 корпус 1"
  }],
  [ "443698", {
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Москва, улица Набережная 46",
    wb_address: "Москва, улица Набережная 46"
  }],
  [ "757074", {
    gender: "Дивчина",
    wishes: "Сюрприз! Главное - внимание и забота 🥰💖",
    ozon_address: "Москва, улица Пушкина 200",
    wb_address: "Москва, улица Пушкина 200"
  }],
  [ "144740", {
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Москва, улица Центральная 159",
    wb_address: "Москва, улица Центральная 159"
  }],
  [ "762566", {
    gender: "Дивчина",
    wishes: "Подарок от сердца - лучший подарок ❤️🤗",
    ozon_address: "Москва, улица Мира 49",
    wb_address: "Москва, улица Мира 49"
  }],
  [ "957273", {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Самара, улица Ленина 97",
    wb_address: "Санкт-Петербург, улица Молодежная 151"
  }]
]);