// 🎅 ДАННЫЕ ТАЙНОГО САНТЫ
// Сгенерировано автоматически. НЕ РЕДАКТИРУЙТЕ ВРУЧНУЮ!

// 🎲 РЕЗУЛЬТАТЫ ЖЕРЕБЬЁВКИ (Map<string, string>)
// Формат: ID Санты → ID Получателя
/*
  883890 → 209424 (МУЖИК → МУЖИК)
  811083 → 558887 (Дивчина → МУЖИК)
  764702 → 811083 (Дивчина → Дивчина)
  691066 → 413401 (Дивчина → МУЖИК)
  592810 → 491213 (Дивчина → Дивчина)
  558887 → 555837 (МУЖИК → МУЖИК)
  210548 → 871622 (МУЖИК → МУЖИК)
  954429 → 120679 (Дивчина → Дивчина)
  120679 → 954429 (Дивчина → Дивчина)
  871622 → 447520 (МУЖИК → Дивчина)
  555837 → 764702 (МУЖИК → Дивчина)
  491213 → 883890 (Дивчина → МУЖИК)
  447520 → 210548 (Дивчина → МУЖИК)
  413401 → 592810 (МУЖИК → Дивчина)
  209424 → 691066 (МУЖИК → Дивчина)
*/

export type DeliveryDataKeys = "gender" | "wishes" | "ozon_address" | "wb_address";
export type DeliveryDataValue = string;

export type DeliveryData = Record<DeliveryDataKeys, DeliveryDataValue>

export const DELIVERY_DATA = new Map<number, DeliveryData>([
  [ 209424, {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Челябинск, улица Гагарина 94 корпус 4",
    wb_address: "Челябинск, улица Гагарина 94 корпус 5"
  }],
  [ 558887, {
    gender: "Дивчина",
    wishes: "Экологичные и локальные продукты поддержу 🌍🛒",
    ozon_address: "Нижний Новгород, улица Гагарина 39",
    wb_address: "Москва, улица Гагарина 197"
  }],
  [ 811083, {
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Москва, улица Гагарина 55 корпус 3",
    wb_address: "Москва, улица Гагарина 55 корпус 6"
  }],
  [ 413401, {
    gender: "Дивчина",
    wishes: "Только натуральная косметика или средства для ухода за кожей, пожалуйста 🌸",
    ozon_address: "Москва, улица Молодежная 157 корпус 4",
    wb_address: "Москва, улица Садовая 29 корпус 4"
  }],
  [ 491213, {
    gender: "Дивчина",
    wishes: "Пожалуйста, без сладкого и соленого. Предпочту что-то полезное или для дома 🌿",
    ozon_address: "Санкт-Петербург, улица Мира 28 корпус 4",
    wb_address: "Санкт-Петербург, улица Мира 28 корпус 6"
  }],
  [ 555837, {
    gender: "МУЖИК",
    wishes: "Чай или кофе ☕",
    ozon_address: "Москва, улица Центральная 82 корпус 5",
    wb_address: "Москва, улица Центральная 82 корпус 5"
  }],
  [ 871622, {
    gender: "МУЖИК",
    wishes: "Люблю сладкое! 🍫",
    ozon_address: "Челябинск, улица Школьная 20",
    wb_address: "Москва, улица Мира 117"
  }],
  [ 120679, {
    gender: "Дивчина",
    wishes: "Что-нибудь полезное 🥦",
    ozon_address: "Москва, улица Молодежная 83",
    wb_address: "Москва, улица Молодежная 83"
  }],
  [ 954429, {
    gender: "Дивчина",
    wishes: "На ваше усмотрение",
    ozon_address: "Москва, улица Школьная 65 корпус 1",
    wb_address: "Москва, улица Школьная 65 корпус 1"
  }],
  [ 447520, {
    gender: "МУЖИК",
    wishes: "Люблю сладкое! 🍫",
    ozon_address: "Челябинск, улица Советская 134",
    wb_address: "Москва, улица Набережная 189 корпус 3"
  }],
  [ 764702, {
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Москва, улица Мира 193 корпус 2",
    wb_address: "Москва, улица Мира 193 корпус 4"
  }],
  [ 883890, {
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Ростов-на-Дону, улица Центральная 33",
    wb_address: "Ростов-на-Дону, улица Центральная 33"
  }],
  [ 210548, {
    gender: "Дивчина",
    wishes: "Обожаю сладости, особенно шоколад и печенье! Чем слаще, тем лучше 🍪😋",
    ozon_address: "Ростов-на-Дону, улица Ленина 35 корпус 5",
    wb_address: "Ростов-на-Дону, улица Ленина 35 корпус 3"
  }],
  [ 592810, {
    gender: "МУЖИК",
    wishes: "Делайте как знаете, доверяю вашему вкусу! ✨🎁",
    ozon_address: "Москва, улица Молодежная 144",
    wb_address: "Москва, улица Молодежная 144"
  }],
  [ 691066, {
    gender: "МУЖИК",
    wishes: "Хотелось бы книгу или что-то для творчества. Ручная работа приветствуется 🎨",
    ozon_address: "Нижний Новгород, улица Молодежная 110",
    wb_address: "Нижний Новгород, улица Молодежная 110"
  }]
]);