export interface Address {
  id_santa: number;
  wishes: string;
  ozon_address: string;
  gender: string;
  wb_address: string;
}

export const ADDRESSES: Readonly<Address[]> = [
  {
    id_santa: 187910,
    gender: "Дивчина",
    wishes: "Пожалуйста без сладкого ( конфетки/шоколад/мед)🙏",
    ozon_address: "Лобня, Лобненский б-р, 9",
    wb_address: "Лобня, Лобненский б-р, 9"
  },
  {
    id_santa: 727635,
    gender: "Дивчина",
    wishes: "",
    ozon_address: "Тула, улица Октябрьская 217 корпус 1",
    wb_address: "Тула, улица Октябрьская 217 корпус 2"
  },
  {
    id_santa: 734562,
    gender: "МУЖИК",
    wishes: "люблю кемпинг",
    ozon_address: "Самара. Георгия Димитрова, 62",
    wb_address: "Самара. Стара-Загора 160"
  },
  {
    id_santa: 88000018,
    gender: "МУЖИК",
    wishes: "Аниме/ПУБГ",
    ozon_address: "Чебоксары, Новогородская 28",
    wb_address: "Соседний дом, не помню адрес, тоже Чебоксары Новогородская, но тот что ближе к 28"
  },
  {
    id_santa: 670286,
    gender: "Дивчина",
    wishes: "Не стеклянное :<",
    ozon_address: "Самара, ул Ново-Садовая, 181",
    wb_address: "Самара, ул Ново-Садовая 179"
  },
  {
    id_santa: 18700910,
    gender: "МУЖИК",
    wishes: "ОГРОМНЫЙ ХУЙ",
    ozon_address: "Москва, Магнитогорская ул., 7",
    wb_address: "(МИ)НЕТ"
  },
  {
    id_santa: 726352,
    gender: "МУЖИК",
    wishes: "",
    ozon_address: "Нижегородская область, Дзержинск, улица Гайдара, 34",
    wb_address: "Дзержинск, улица Гайдара 35"
  },
  {
    id_santa: 332574,
    gender: "МУЖИК",
    wishes: "https://ozon.ru/t/T8BvOTX",
    ozon_address: "Новосибирск, улица Кошурникова, 24/1",
    wb_address: "Новосибирск, Улица Бориса Богаткова 213"
  }
]